app/controllers/customers_controller.rb

  def index
    @customers = Customer.all
    @customer = Customer.new
    @custByID = Customer.where(id: params[:id])
---
SELECT "customers".* FROM "customers"
SELECT "customers".* FROM "customers"  WHERE "customers"."id" IS NULL

  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save
---
INSERT INTO "customers" ("address", "city", "company", "contact", "created_at", "email", "fax", "phone", "state", "suite", "updated_at", "zip") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)