app/controllers/evictions_controller.rb

SELECT "evictions".* FROM "evictions"
---
  def index
    @eviction = Eviction.new
    @evictions = Eviction.all

SELECT "evictions".* FROM "evictions"
---
  def evictionlist
    @eviction = Eviction.new
    @evictions = Eviction.all

INSERT INTO "evictions" ("address", "case", "city", "created_at", "defendant", "ejected", "h_s_v", "phone", "plantiff", "scheduled", "state", "updated_at", "zip") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @eviction = Eviction.new(eviction_params)

    respond_to do |format|
      if @eviction.save

SELECT  "evictions".* FROM "evictions"  WHERE "evictions"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_eviction
      @eviction = Eviction.find(params[:id])