app/controllers/properties_controller.rb

INSERT INTO "properties" ("contact", "created_at", "direct", "name", "office", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["contact", "that lady"], ["created_at", "2015-08-18 18:43:10.607780"], ["direct", "770-256-2656"], ["name", "Test APT"], ["office", "404-428-9487"], ["updated_at", "2015-08-18 18:43:10.607780"]]
---
  def create
    @property = Property.new(property_params)

    respond_to do |format|
      if @property.save