app/controllers/tweets_controller.rb

INSERT INTO "tweets" ("created_at", "message", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2015-08-21 00:45:24.692318"], ["message", "dfsf"], ["updated_at", "2015-08-21 00:45:24.692318"], ["user_id", 1]]
---
  def create
    @tweet = Tweet.new(tweet_params)
    @tweet.save