app/views/evictions/_form.html.erb

                </a>
                <%= collection_select(:eviction, :customer_id, Customer.all, :id, :company_and_id, prompt: true, id: "menu1", class: "dropdown-menu", role: "menu", ) %>
---
SELECT "customers".* FROM "customers"
SELECT "evictions".* FROM "evictions"