app/views/evictions/index.html.erb

              <ul class="dropdown-menu" role="menu">
                <% Customer.all.each do |customer| %>
---
SELECT  "customers".* FROM "customers"   ORDER BY "customers"."id" ASC LIMIT 1